DISTORTEC/distortos/source/chip/STMicroelectronics/STM32F4/STM32F4-chipVectors.cpp
#if defined(STM32F401_VECTORS) || defined(STM32F410_VECTORS) || defined(STM32F411_VECTORS)

		__Reserved_0x168_Handler,			// 0x168, 74: Reserved
		__Reserved_0x16c_Handler,			// 0x16c, 75: Reserved

#else	// !defined(STM32F401_VECTORS) && !defined(STM32F410_VECTORS) && !defined(STM32F411_VECTORS)

		OTG_HS_EP1_OUT_IRQHandler,			// 0x168, 74: USB OTG HS End Point 1 Out
		OTG_HS_EP1_IN_IRQHandler,			// 0x16c, 75: USB OTG HS End Point 1 In

#endif	// !defined(STM32F401_VECTORS) && !defined(STM32F410_VECTORS) && !defined(STM32F411_VECTORS)

#if defined(STM32F401_VECTORS) || defined(STM32F411_VECTORS)

		__Reserved_0x170_Handler,			// 0x170, 76: Reserved

#elif defined(STM32F410_VECTORS)

		EXTI20_IRQHandler,					// 0x170, 76: EXTI Line 20

#else	// !defined(STM32F401_VECTORS) && !defined(STM32F410_VECTORS) && !defined(STM32F411_VECTORS)

		OTG_HS_WKUP_IRQHandler,				// 0x170, 76: USB OTG HS Wakeup through the EXTI line

#endif	// !defined(STM32F401_VECTORS) && !defined(STM32F410_VECTORS) && !defined(STM32F411_VECTORS)

#if defined(STM32F401_VECTORS) || defined(STM32F410_VECTORS) || defined(STM32F411_VECTORS)

		__Reserved_0x174_Handler,			// 0x174, 77: Reserved
		__Reserved_0x178_Handler,			// 0x178, 78: Reserved
		__Reserved_0x17c_Handler,			// 0x17c, 79: Reserved

#else	// !defined(STM32F401_VECTORS) && !defined(STM32F410_VECTORS) && !defined(STM32F411_VECTORS)

		OTG_HS_IRQHandler,					// 0x174, 77: USB OTG HS
		DCMI_IRQHandler,					// 0x178, 78: DCMI
		CRYP_IRQHandler,					// 0x17c, 79: CRYP crypto

#endif	// !defined(STM32F401_VECTORS) && !defined(STM32F410_VECTORS) && !defined(STM32F411_VECTORS)

#if defined(STM32F401_VECTORS) || defined(STM32F411_VECTORS)

		__Reserved_0x180_Handler,			// 0x180, 80: Reserved

#elif defined(STM32F410_VECTORS)

		RNG_IRQHandler,						// 0x180, 80: RNG

#else	// !defined(STM32F401_VECTORS) && !defined(STM32F410_VECTORS) && !defined(STM32F411_VECTORS)

		HASH_RNG_IRQHandler,				// 0x180, 80: Hash and RNG

#endif	// !defined(STM32F401_VECTORS) && !defined(STM32F410_VECTORS) && !defined(STM32F411_VECTORS)

		FPU_IRQHandler,						// 0x184, 81: FPU

#if defined(STM32F401_VECTORS) || defined(STM32F410_VECTORS) || defined(STM32F411_VECTORS)

		__Reserved_0x188_Handler,			// 0x188, 82: Reserved
		__Reserved_0x18c_Handler,			// 0x18c, 83: Reserved

#elif defined(STM32F42_STM32F43_VECTORS)

		UART7_IRQHandler,					// 0x188, 82: UART7
		UART8_IRQHandler,					// 0x18c, 83: UART8

#endif	// defined(STM32F42_STM32F43_VECTORS)

#if defined(STM32F410_VECTORS)

		__Reserved_0x190_Handler,			// 0x190, 84: Reserved

#elif defined(STM32F401_VECTORS) || defined(STM32F411_VECTORS) || defined(STM32F42_STM32F43_VECTORS)

		SPI4_IRQHandler,					// 0x190, 84: SPI4

#endif	// defined(STM32F401_VECTORS) || defined(STM32F411_VECTORS) || defined(STM32F42_STM32F43_VECTORS)

#if defined(STM32F410_VECTORS) || defined(STM32F411_VECTORS) || defined(STM32F42_STM32F43_VECTORS)

		SPI5_IRQHandler,					// 0x194, 85: SPI5

#endif	// defined(STM32F410_VECTORS) || defined(STM32F411_VECTORS) || defined(STM32F42_STM32F43_VECTORS)

#if defined(STM32F410_VECTORS)

		__Reserved_0x198_Handler,			// 0x198, 86: Reserved
		__Reserved_0x19c_Handler,			// 0x19c, 87: Reserved
		__Reserved_0x1a0_Handler,			// 0x1a0, 88: Reserved
		__Reserved_0x1a4_Handler,			// 0x1a4, 89: Reserved
		__Reserved_0x1a8_Handler,			// 0x1a8, 90: Reserved

#elif defined(STM32F42_STM32F43_VECTORS)

		SPI6_IRQHandler,					// 0x198, 86: SPI6
		SAI1_IRQHandler,					// 0x19c, 87: SAI1
		LTDC_IRQHandler,					// 0x1a0, 88: LTDC
		LTDC_ER_IRQHandler,					// 0x1a4, 89: LTDC error
		DMA2D_IRQHandler,					// 0x1a8, 90: DMA2D

#endif	// defined(STM32F42_STM32F43_VECTORS)

#if defined(STM32F410_VECTORS)

		__Reserved_0x1ac_Handler,			// 0x1ac, 91: Reserved
		__Reserved_0x1b0_Handler,			// 0x1b0, 92: Reserved
		__Reserved_0x1b4_Handler,			// 0x1b4, 93: Reserved
		__Reserved_0x1b8_Handler,			// 0x1b8, 94: Reserved
		FMPI2C1_EV_IRQHandler,				// 0x1bc, 95: FMPI2C1 Event
		FMPI2C1_ER_IRQHandler,				// 0x1c0, 96: FMPI2C1 Error
		LPTIM1_IRQHandler,					// 0x1c4, 97: LPTIM1 through the EXTI line

#endif	// defined(STM32F410_VECTORS)

};

namespace
{

/// expected number of chip vectors
constexpr size_t expectedChipVectorsSize
{
#if defined(STM32F401_VECTORS)
		85
#elif defined(STM32F405_STM32F407_STM32F415_STM32F417_VECTORS)
		82
#elif defined(STM32F410_VECTORS)
		98
#elif defined(STM32F411_VECTORS)
		86
#elif defined(STM32F42_STM32F43_VECTORS)
		91
#else
#	error "Wrong configuration or unsupported STM32F4 chip!"
#endif
};

static_assert(sizeof(chipVectors) / sizeof(*chipVectors) == expectedChipVectorsSize, "Invalid size of chipVectors[]!");

}	// namespace
